# BONUS - US Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [23]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from the folder `data` you'll find in the main folder `BONUS`

Hint: you should go one folder back (use `..` for that aim)

In [46]:
baby_names = pd.read_csv("../data/baby_names.csv", low_memory=False)

### Step 3. Assign it to a variable called `baby_names`.

In [25]:
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [26]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [27]:
baby_names = baby_names.drop(columns=["Unnamed: 0", "Id"])
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [37]:
baby_names.groupby("Gender")["Name"].count()

Gender
F    558846
M    457549
Name: Name, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [31]:
baby_names.groupby("Name")["Name"].describe()

        count unique      top freq
Name
Aaban       2      1    Aaban    2
Aadan       4      1    Aadan    4
Aadarsh     1      1  Aadarsh    1
Aaden     196      1    Aaden  196
Aadhav      1      1   Aadhav    1
...       ...    ...      ...  ...
Zyra        7      1     Zyra    7
Zyrah       2      1    Zyrah    2
Zyren       1      1    Zyren    1
Zyria      10      1    Zyria   10
Zyriah      9      1   Zyriah    9

[17632 rows x 4 columns]

### Step 8. How many different names exist in the dataset?

In [36]:
baby_names["Name"].nunique()

17632

### Step 9. What is the name with most occurrences?

In [44]:
baby_names.groupby("Name")["Count"].count()

Name
Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

### Step 13. Get a summary with the mean, min, max, std and quartiles.